Repository: slavig/pepperspray
Catalog: pepperspray/Resources/Strings.*.resx
Languages: ru

# ADMIN_NOT_AUTHENTICATED
source: Not authenticated. Incident will be reported.
ru: Недостаточно прав. Об инциденте будет уведомлено.

source: Character not found.
ru: Персонаж не найдет.

# CHAT_MODE_MUTED
source: muted
ru: мьют

# CHAT_MODE_NO_RESTRICTIONS
source: no restrictions
ru: без ограничений

# CHAT_MODE_SLOWMODE
source: slowmode ({0} s)
ru: медленный ({0} с)

source: Configuration file reloaded.
ru: Конфигурационный файл перезагружен.

# CURRENCY_IS_NOT_ENABLED
source: Currency is not enabled on this server.
ru: Валюта не включена на этом сервере.

# CURRENT_CHAT_MODE
source: Chat mode: {0}.
ru: Режим чата: {0}.

# CURRENT_SEX_MODE
source: Current sex mode: {0} ({1}).
ru: Ваш текущий режим: {0} ({1}).

# DISCONNECTING_ON_TIMEOUT_LONG
source: Connection will be terminated in 10 seconds. Reason: {0} Internal code: {1}.
ru: Вы будете отключены от сервера через 10 секунд. Причина: {0} Внутренний код ошибки: {1}.

# DISCONNECTING_ON_TIMEOUT_SHORT
source: DISCONNECTED FROM SERVER, disconnecting in 10s.: {0}
ru: ОТКЛЮЧЕНИЕ ОТ СЕРВЕРА через 10с.: {0}

source: Done.
ru: Готово.

# DURATION_CANT_BE_MORE_MINUTES
source: Duration can't be more than {0} minutes!
ru: Продолжительность не может превышать {0} минут!

# DURATION_HAS_BEEN_SPECIFIED_INCORRECTLY
source: Duration has been specified incorrectly, it should be a number.
ru: Продолжительность была указана неправильно, это должно быть число.

source: Failed to reload configuration:
ru: Ошибка при перезагрузке конфигурации:

source: Forbidden.
ru: Запрещено.

# GAVE_COINS_TO
source: Player {0} gave {1} coins to {2}.
ru: Игрок {0} передал {1} монет игроку {2}.

source: Internal server error.
ru: Внутренная ошибка сервера.

source: Invalid amount.
ru: Неправильное количество.

source: Invalid usage.
ru: Неправильные аргументы.

# LOGGED_IN_AS_ANOTHER_CHAR
source: Logged as another character.
ru: Вход с другого персонажа.

# LOGGED_IN_IN_ANOTHER_INSTANCE
source: Logged in another instance.
ru: Вход с другой инстанции игры.

source: Login token invalid.
ru: Неверный токен входа.

# MAXIMUM_LINE_COUNT_EXCEEDED
source: Prompt maximum line count ({0}) exceeded.
ru: Превышено максимальное количество строк ({0}).

# MAXIMUM_LINE_LENGTH_EXCEEDED
source: Prompt maximum line length ({0}) exceeded.
ru: Превышена максимальная длина строки ({0}).

# MESSAGE_TO_WORLD_HAS_BEEN_SENT
source: Your message to World has been sent ({0} coins), you now have {1} coins.
ru: Ваше сообщение было отправлено в World (стоимость - {0} монет). У вас осталось {1} монет.

# NOT_AUTHORIZED_TO_PLAY_AS_THIS_CHARACTER
source: You are not authorized to play as this character.
ru: Вы не авторизованы что бы играть этим персонажем.

source: Not enough coins!
ru: Недостаточно монет!

# NOT_ENOUGH_COINS_REQUIRED
source: Not enough coins, this operation costs {0} coins and you currently have {1}.
ru: Недостаточно монет, эта операция стоит {0} монет, а у вас {1}.

# ONLINE_PLAYERS_COLON
source: Online players:
ru: Игроки онлайн:

# PHOTO_SLOTS_NUMBER_EXCEEDED
source: Maximum number of photo slots on this server is {0}.
ru: Максимальное количество фотографий на этом сервере: {0}.

source: Player has been expelled.
ru: Игрок был исключен.

# PLAYER_HAS_BEEN_KICKED
source: Player {0} has been kicked.
ru: Игрок {0} был кикнут.

# PLAYER_IS_OFFLINE_MESSAGES_WILL_BE_DELIVERED
source: Player is offline, messages will be only delivered to him on his next sign in.
ru: Игрок оффлайн, сообщения будут доставлены когда он следующий раз зайдет в игру.

source: Player is online, you can message him.
ru: Игрок онлайн, вы можете написать ему сообщение.

# PLAYER_NOT_FOUND
source: Player not found: "{0}"
ru: Игрок не найден: "{0}"

# PLAYER_ROLLED_OUT_OF
source: Player {0} rolled {1} out of {2}.
ru: Игроку {0} выпало {1} из {2}.

# PLAYER_ROLLED_OUT_OF_VERIFY
source: Player {0} rolled {1} out of {2}; verify by server message.
ru: Игроку {0} выпало {1} из {2}; проверьте через сообщение сервера.

# PLAYER_SENT_YOU_COINS
source: Player {0} sent you {1} coins{2}, you now have {3}.
ru: Игрок {0} отправил вам {1} монет{2}, у вас теперь в сумме {3} монет.

# REASON_NONE
source: None given.
ru: Нету.

source: Room closed.
ru: Комната закрыта.

# ROOM_HAS_NOT_BEEN_FOUND
source: Room {0} has not been found.
ru: Комната {0} не была найдена.

# ROOM_IS_NOW_PERSISTENT
source: Room is now persistent. It will stay opened for {0} minutes after you log-off. Remember that you can only close it by "/room close".
ru: Комната теперь постоянная. Она будет оставаться открытой до {0} минут после вашего выхода из игры. Помните, что закрыть ее можно только через "/room close".

source: Room now not prioritized.
ru: Комната больше не приоритезирована.

source: Room now prioritized.
ru: Комната теперь приоритезирована.

source: Room prompt has been set.
ru: Приветствие комнаты было установлено.

# SEX_IS_FORBIDDEN_IN_ROOM
source: Sorry, sex is forbidden in this room.
ru: Извините, секс запрещен в этой комнате.

# SEX_IS_NOW_ALLOWED_IN_ROOM
source: Sex is now allowed in this room.
ru: Секс теперь разрешен в этой комнате.

# SEX_IS_NOW_FORBIDDEN_IN_ROOM
source: Sex is now forbidden in this room.
ru: Секс теперь запрещен в этой комнате.

# SEX_MODE_DESCRIPTION_DEFAULT
source: need agreement for everything
ru: на все нужно соглашение

# SEX_MODE_DESCRIPTION_DENY
source: deny partner requests
ru: отклонять все запросы

# SEX_MODE_DESCRIPTION_POSEAGREE
source: need agreement for partner requests, don't need agreement to start sex
ru: нужно подтверждение для добавления партнера, позы - без подтверждения

# SHELL_HELP_TEXT
source: Following commands are available: /players - show how many players are at standard locations. /money - get amount of coints you have right now. /myonline - display for how much you have been online (across all characters). /pm PLAYER - open private message window with PLAYER. /dice NUMBER - roll the dice. Number will be omitted, defaulting to 6. /pay PLAYER AMOUNT - transfer currency to other player. You can omit PLAYER if you send the command to him directly. /give - the same as /pay, but sends a message into Local chat about the deal. /expel PLAYER MINUTES - expel player from your location for MINUTES. Duration can be skipped so the player will only be kicked. You can omit the name if you send this command to him directly. /room persist - will turn your room into semi-persistent one, meaning that it will be available for some time after you disconnect. /room close - will close your currently shared room. /room sex VALUE - "allow" to allow sex in your room, "forbid" to forbid it. /room prompt VALUE - set prompt (welcome message) for room. Character "\" user for newline. /room slowmode MODE - set room slowmode settings ("reset" to reset, "mute" to mute everyone else or amount of seconds to enable slowmode on provided interval). /sex VALUE - set extended sex permissions. VALUE is - "sub" to allow poses without confirmation, "deny" to deny incoming partner requests and "reset" to reset to default.
ru: Следующие команды доступны: /players - показать сколько игроков в стандартных локациях. /money - показать количество ваших монет. /myonline - показать суммарное время онлайна (на всех персонажах). /pm ИГРОК - открыть окно личных сообщений с ИГРОК. /dice ЧИСЛО - кинуть кубик.ЧИСЛО можно не указывать, мо умолчанию будет 6. /pay ИГРОК КОЛИЧЕСТВО - передать монеты другому игроку. Имя можно не указывать, если вы пишете эту команду в ПМ игроку, которому хотите отправить деньги. /give - то же самое, что и /pay, только пишет сообщение о сделке в Local. /expel ИГРОК ДЛИТЕЛЬНОСТЬ - исключить игрока с комнаты на указанное количество минут. Длительность может быть исключена что бы просто кикнуть его. Имя можно не указывать, если вы пишете эту команду в ПМ игроку, которого хотите кикнуть. /room persist - сделать комнату постоянной,что бы она оставалась открытой на некоторое время после вашего выхода из игры. /room close - закроет вашу текущую комнату. /room sex ЗНАЧЕНИЕ - "allow" что бы разрешить секс в комнате, "forbid" что бы запретить его. /room prompt ТЕКСТ - установить приветствие для команды. Для переноса строки используйте "\". /room slowmode ЗНАЧЕНИЕ - установить настройки чата для комнаты. ЗНАЧЕНИЕ это либо количество секунд, которое будет интервалом слоу-мода, либо "reset" (вернет стандартные настройки) либо "mute" (замьютит всех). /sex ЗНАЧЕНИЕ - установить настройки секса. ЗНАЧЕНИЕ - "sub" что бы разрешить включение поз без подтверждения, "deny" что бы запретить кидать запрос на добавление в партнеры и "reset" что бы вернуться к стандартному поведению.

# SORRY_CHAT_IS_MUTED
source: Sorry, chat has been muted by the owner.
ru: Извините, чат замьючен владельцем комнаты.

# STATUS_FOR_PLAYER_HAS_BEEN_SET
source: Status for player {0} has been set to "{1}".
ru: Статус аккаунта {0} был установлен в "{1}".

# THIS_FEATURE_IS_NOT_ENABLED
source: This feature is not enabled on the server.
ru: Эта возможность не включена на сервере.

# TIMED_OUT
source: Connection timed out.
ru: Подключение превысило время ожидания.

# TOO_FAST_CHAT_IS_IN_SLOWMODE
source: Too fast, chat is in slowmode ({0} s).
ru: Слишком быстро, чат в медленном режиме ({0} с).

# TRANSFERRED_COINS_TO
source: Transferred {0} coins to {1}, you now have {2}.
ru: Передано {0} монет игроку {1}, у вас осталось {2}.

# UNKNOWN_COMMAND
source: Uknown command: "{0}".
ru: Неизвестная команда: "{0}".

source: Unknown command, see /help.
ru: Неизвестная команда, смотрите /help.

# USER_HAS_NOT_BEEN_FOUND_FOR_PLAYER
source: User account has not been found for this player.
ru: Аккаунт пользователя не был найден для этого игрока!

source: Your mode has been changed.
ru: Режим был изменен.

source: You are not in lobby.
ru: Вы сейчас не находитесь в лобби.

# YOU_ARE_NOT_IN_ROOM
source: You are not currently in a room!
ru: Вы сейчас не находитесь в комнате!

# YOU_CURRENTLY_HAVE_COINTS
source: You currently have {0} coins.
ru: У вас {0} монет.

source: You don't currently own a room!
ru: У вас сейчас нету публичной комнаты!

# YOU_DONT_HAVE_COINS_TO_WRITE_IN_WORLD
source: You don't have {0} coins to write in World chat (you only have {1}).
ru: Извините, вам нужно {0} монет что бы написать в World чат (у вас только {1}).

# YOU_DONT_HAVE_PERMISSION_TO_MODERATE_ROOM
source: You don't have permissions to moderate this room!
ru: У вас нету полномочий что бы модерировать эту комнату!

# YOU_HAVE_BEEN_GIFTED_COINS_FROM_ADMIN
source: You have been gifted {0} coins from admin.
ru: Вам было начислено {0} монет от администрации.

# YOU_HAVE_BEEN_ONLINE_FOR_HOURS
source: You have been online for {0} hours.
ru: Вы были онлайн {0} ч.

source: You should be in the room to moderate it!
ru: Вам необходимо находится в комнате, что бы модерировать ее.
